tap "homebrew/bundle"
tap "homebrew/cask"
tap "github/gh"
tap "homebrew/cask-fonts"

brew "bash"
brew "bash-completion"

brew "zsh-completion"

brew "curl"
brew "wget"
brew "httpie"
brew "rsync"

brew "direnv"

brew "stow"
brew "fzf"
brew "git"
brew "gh"
brew "jq"
brew "openssl"
brew "lua"
brew "rg"
brew "gnu-sed", args: ["--with-default-names"]
brew "ctags"
brew "git-delta"

brew "neovim"
brew "vim", args: ["--with-lua"]
brew "bat"

brew "go"
brew "node"
brew "python"
brew "python@2"

brew "npm"
brew "poetry"
brew "yarn"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "glide"
brew "maven"
brew "circleci"

brew "ssh-copy-id"
brew "pwgen"
brew "ansible"
brew "kubectl"
brew "kubectx"
brew "stern"
brew "packer"
brew "terraform"
brew "vault"
brew "awscli"

brew "mas"

cask "font-sourcecodepro-nerd-font-mono"
cask "font-sourcecodepro-nerd-font"
cask "font-jetbrainsmono-nerd-font-mono"
cask "font-jetbrainsmono-nerd-font"

cask "iterm2"
cask "mysides"

cask "firefox"
cask "google-chrome"

cask "docker"
cask "adoptopenjdk"
cask "java"
cask "virtualbox"
cask "vagrant"
cask "powershell"
cask "aws-vault"

cask "visual-studio-code"
cask "pycharm-ce"

mas "Slack", id: 803453959
mas "MindNode", id: 1289197285
mas "Kindle", id: 405399194
