brew "chezmoi"
brew "starship"
brew "zsh-completions"

tap "bufbuild/buf"
tap "cloudflare/cloudflare"
tap "danielfoehrkn/switch"
tap "datreeio/datree"
tap "fluxcd/tap"
tap "github/gh"
tap "helm/tap"
tap "homebrew/core"
tap "hashicorp/tap"
tap "johanhaleby/kubetail"
tap "k0sproject/tap"
tap "sl1pm4t/k2tf", "https://github.com/sl1pm4t/k2tf.git"

# {{- if eq .chezmoi.os "darwin" }}
## Macos-specific formulae
brew "curl"
brew "wget"
brew "rsync"


brew "ssh-copy-id"
brew "openssl"
brew "gnu-sed"
brew "watch"
brew "telnet"
brew "dos2unix"
brew "diffutils"
brew "cmake"
# {{ end -}}

brew "direnv"
brew "bat"
brew "exa"
brew "fd"
brew "ripgrep"

brew "fzf"
brew "jq"

brew "git"
brew "gh"
brew "git-delta"
brew "pre-commit"
brew "ctags"

brew "lua"

brew "neovim"
brew "vim"

brew "mage"
brew "go"
brew "grpcurl"
brew "protobuf"
brew "sqlc"
brew "goreleaser"

brew "cosign"
brew "syft"

brew "node"
brew "yarn"

brew "poetry"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"

brew "docker"
brew "docker-compose"
brew "docker-credential-helper"

brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "helm"
brew "johanhaleby/kubetail/kubetail"
brew "stern"
brew "danielfoehrkn/switch/switch"
brew "datreeio/datree/datree"
brew "fluxcd/tap/flux"
brew "helm/tap/chart-releaser"
brew "k0sproject/tap/k0sctl"
brew "derailed/k9s/k9s"
brew "int128/kubelogin/kubelogin"
brew "k2tf"

brew "terraform"
brew "terraform-docs"
brew "terragrunt"
brew "hashicorp/tap/terraform-ls"
brew "tflint"

brew "prometheus"

brew "awscli"
brew "azure-cli"

brew "lua-language-server"
brew "bash-language-server"
brew "yaml-language-server"
brew "yamllint"

brew "act"
brew "age"
brew "bitwarden-cli"
brew "libfido2"
brew "sops"
brew "gnupg"
brew "step"
brew "pwgen"

brew "gatsby-cli"
brew "hasura-cli"

brew "openjdk"

# {{- if eq .chezmoi.os "darwin" }}
tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "mas"
cask "mysides"

cask "font-sauce-code-pro-nerd-font"
cask "font-jetbrains-mono-nerd-font"

cask "iterm2"

{{ if .personal -}}
cask "rancher"
cask "authy"
cask "disk-inventory-x"
cask "gimp"
cask "inkscape"
cask "figma"
cask "skype"
cask "virtualbox"
cask "libreoffice"
{{ end }}

cask "firefox"

cask "visual-studio-code"

{{ if not .restricted -}}
cask "obsidian"
cask "google-chrome"
cask "lulu"
brew "cloudflare/cloudflare/cloudflared"
cask "cloudflare-warp"
mas "WireGuard", id: 1451685025
{{ end }}

mas "Bitwarden", id: 1352778147
mas "Kindle", id: 302584613
mas "MindNode", id: 1289197285
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
# {{ end }}
