brew "chezmoi"
brew "antidote"
brew "starship"
brew "romkatv/gitstatus/gitstatus"

tap "bufbuild/buf"
tap "cloudflare/cloudflare"
tap "danielfoehrkn/switch"
tap "datreeio/datree"
tap "fluxcd/tap"
tap "github/gh"
tap "helm/tap"
tap "hashicorp/tap"
tap "johanhaleby/kubetail"
tap "k0sproject/tap"
tap "goreleaser/tap"

# {{- if eq .chezmoi.os "darwin" }}
## Macos-specific formulae
brew "curl"
brew "wget"
brew "rsync"

brew "ssh-copy-id"
brew "openssl"
brew "gnu-sed"
brew "watch"
brew "telnet"
brew "dos2unix"
brew "diffutils"
brew "cmake"
# {{ end -}}

brew "direnv"
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "mise"

brew "fzf"
brew "jq"

brew "git"
brew "gh"
brew "difftastic"
brew "ctags"

brew "lua"

brew "neovim"
brew "vim"

brew "go"
brew "grpcurl"
brew "grpcui"
brew "protobuf"
brew "buf"
brew "sqlc"
cask "goreleaser/tap/goreleaser-pro"

brew "cosign"
brew "syft"
brew "minica"

brew "node"
brew "yarn"
brew "pnpm"

brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"

brew "docker"
brew "docker-compose"
brew "docker-credential-helper"

brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "helm"
brew "johanhaleby/kubetail/kubetail"
brew "stern"
brew "danielfoehrkn/switch/switch"
brew "datreeio/datree/datree"
brew "fluxcd/tap/flux"
brew "helm/tap/chart-releaser"
brew "k0sproject/tap/k0sctl"
brew "derailed/k9s/k9s"
brew "int128/kubelogin/kubelogin"

brew "hashicorp/tap/terraform"

brew "awscli"
brew "azure-cli"

brew "act"
brew "age"
brew "sops"
brew "gnupg"
brew "pwgen"

# {{- if eq .chezmoi.os "darwin" }}

brew "mas"
cask "mysides"

cask "font-sauce-code-pro-nerd-font"
cask "font-jetbrains-mono-nerd-font"

cask "ghostty"

{{ if .personal -}}
cask "disk-inventory-x"
cask "gimp"
cask "inkscape"
cask "figma"
cask "libreoffice"
{{ end }}

cask "visual-studio-code"

{{ if not .restricted -}}
cask "rancher"
cask "obsidian"
cask "firefox"
cask "google-chrome"
cask "cloudflare-warp"
mas "WireGuard", id: 1451685025
mas "Slack", id: 803453959
{{ end }}

mas "Bitwarden", id: 1352778147
mas "Kindle", id: 302584613
mas "MindNode", id: 1289197285
mas "Xcode", id: 497799835
# {{ end }}
