brew "chezmoi"
brew "bitwarden-cli"
brew "fish"
brew "fisher"
brew "antidote"
brew "starship"
brew "romkatv/gitstatus/gitstatus"

tap "bufbuild/buf"
tap "cloudflare/cloudflare"
tap "danielfoehrkn/switch"
tap "datreeio/datree"
tap "fluxcd/tap"
tap "github/gh"
tap "helm/tap"
tap "hashicorp/tap"
tap "johanhaleby/kubetail"
tap "k0sproject/tap"
tap "goreleaser/tap"

# {{- if eq .chezmoi.os "darwin" }}
## Macos-specific formulae
brew "curl"
brew "wget"
brew "rsync"

brew "ssh-copy-id"
brew "openssl"
brew "gnu-sed"
brew "watch"
brew "telnet"
brew "dos2unix"
brew "diffutils"
brew "cmake"
# {{ end -}}

brew "direnv"
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "mise"

brew "fzf"
brew "jq"

brew "git"
brew "gh"
brew "difftastic"
brew "ctags"

brew "lua"

brew "neovim"
brew "vim"

brew "go"
brew "grpcurl"
brew "grpcui"
brew "protobuf"
brew "buf"
brew "sqlc"
cask "goreleaser/tap/goreleaser-pro"

brew "cosign"
brew "syft"
brew "minica"

brew "node"
brew "yarn"
brew "pnpm"

brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"

brew "docker"
brew "docker-compose"
brew "docker-credential-helper"

brew "kubernetes-cli"
brew "krew"
brew "kustomize"
brew "helm"
brew "johanhaleby/kubetail/kubetail"
brew "stern"
brew "danielfoehrkn/switch/switch"
brew "datreeio/datree/datree"
brew "fluxcd/tap/flux"
brew "helm/tap/chart-releaser"
brew "k0sproject/tap/k0sctl"
brew "derailed/k9s/k9s"
brew "int128/kubelogin/kubelogin"

brew "hashicorp/tap/terraform"

brew "awscli"
brew "azure-cli"

brew "act"
brew "age"
brew "sops"
brew "gnupg"
brew "pwgen"

# {{- if eq .chezmoi.os "darwin" }}

brew "mas"
cask "mysides"

cask "font-sauce-code-pro-nerd-font"
cask "font-jetbrains-mono-nerd-font"

cask "ghostty"

{{ if .personal -}}
cask "disk-inventory-x"
cask "gimp"
cask "inkscape"
cask "figma"
cask "libreoffice"
{{ end }}

cask "visual-studio-code"

{{ if not .restricted -}}
cask "rancher"
cask "obsidian"
cask "firefox"
cask "google-chrome"
mas "WireGuard", id: 1451685025
mas "Slack", id: 803453959
{{ end }}

mas "Bitwarden", id: 1352778147
mas "Kindle", id: 302584613
mas "MindNode", id: 1289197285
mas "Xcode", id: 497799835
# {{ end }}

vscode "adamhartford.vscode-base64"
vscode "alphabotsec.vscode-eclipse-keybindings"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "bufbuild.vscode-buf"
vscode "dbaeumer.vscode-eslint"
vscode "disolaterx.kamailio-cfg-formatting"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hverlin.mise-vscode"
vscode "jdinhlife.gruvbox"
vscode "miconda.kamailio-syntax"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "mukundan.python-docs"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sourcegraph.amp"
vscode "tamasfe.even-better-toml"
vscode "tamuratak.vscode-lezer"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscodevim.vim"
vscode "zxh404.vscode-proto3"
vscode "ultram4rine.sqltools-clickhouse-driver"
vscode "kcl.kcl-vscode-extension"
vscode "christian-kohler.path-intellisense"
vscode "quicktype.quicktype"
vscode "davidanson.vscode-markdownlint"
vscode "github.vscode-github-actions"
